<template>
  <section class="pt-8 px-4 md:px-10 md:py-0 lg:px-20 2xl:px-24">
    <ProfileBlockInfo
      title="Цель создания собственного сайта"
      description="На данном сайте представлена информация о моей профессиональной деятельности и выполненных проектах. Основная цель — продемонстрировать портфолио веб-разработчика."
      image="/images/profile1.png"
    />

    <ProfileBlockInfo
      image-right
      title="Моя страсть — создание веб-приложений"
      description="В прошлом я работал инженером в области информационно-аналитических систем, однако со временем нашел свое истинное призвание в сфере информационных технологий. Получаю огромное удовольствие от своей работы и стремлюсь к постоянному развитию в этой динамичной области. Уже более 5 лет занимаюсь разработкой приложений для МО."
      image="/images/profile2.png"
    />
  </section>
</template>

<script setup>

</script>

<style lang="scss" scoped></style>