<template>
  <article>
    <section>
      <PagePreview :value="{ title: 'Nikita Chepik', description: 'Привет! Я веб-разработчик!' }" />
    </section>
    <section>
      <AboutHistory
        title="Почему я выбрал веб-разработку"
        :text="historyText"
      />
    </section>
    <section>
      <AboutSkills
        title="Навыки"
        :items="skillItems"
      />
    </section>
    <section>
      <div class="py-8">
        <div class="the-title-main text-center py-2">Стек технологий</div>
        <div
          class="mx-auto mt-4 grid gap-4 grid-cols-4 sm:grid-cols-5 lg:grid-cols-8 items-center justify-center px-20">
          <div v-for="(img, ind) in images" :key="ind" class="flex justify-center">
            <div class="border-[1px] border-[#B8B799] p-3 sm:p-4 bg-white/20">
              <div class="h-6 w-6 sm:h-14 sm:w-14">
                <NuxtImg :src="`${img}.svg`" />
              </div>
            </div>
          </div>
        </div>
      </div>
    </section>
  </article>
</template>

<script setup lang="ts">

const { data, skills, status } = await useFetch('api/skill/list', {
  method: 'GET',
});

console.log('test', data, skills, status)

const historyText = [
  `Программирование - это возможность постоянно учиться и развиваться.
  В IT-сфере технологии и инструменты быстро меняются, и каждый новый проект дает шанс освоить что-то новое,
  что делает работу интересной и разнообразной.
  Мне нравится видеть результаты своей работы. Создание программного обеспечения, которое решает реальные
  проблемы людей, приносит удовлетворение.
  Я чувствую гордость, когда вижу, как мои разработки помогают людям или улучшают процессы в компаниях.
  Также я ценю творческий аспект программирования. Хотя это техническая профессия, в ней много места для
  креативности.
  Придумывать архитектуру приложения, разрабатывать интерфейсы и находить нестандартные решения — все это
  позволяет проявлять свои идеи и подходы.`,
  `Кроме того, работа в команде с талантливыми людьми вдохновляет. Обсуждение идей, обмен опытом и
  совместное
  решение сложных задач создают атмосферу сотрудничества и поддержки.
  Это не только помогает достигать лучших результатов, но и делает рабочие будни более приятными.`,
  `Наконец, я люблю ту свободу, которую предоставляет эта профессия. Возможность работать удаленно,
  выбирать
  проекты и гибко управлять своим временем делает работу программистом привлекательной и комфортной.
  Все эти аспекты делают мою карьеру в программировании увлекательной и значимой.`,
];

const skillItems = [
  {
    title: 'Soft Skills',
    text: [
      `Лидерство и управление:
        управление командой разработчиков;
        постановка задач, распределение ролей, мотивация команды.`,
      `Коммуникация:
        умение ясно и доступно объяснять сложные концепции;
        эффективная работа с другими отделами (дизайнерами, аналитиками, QA).`,
      `Решение проблем: аналитический подход к сложным задачам, поиск нестандартных решений.`,
      `Ответственность: готовность брать ответственность за результат команды.`,
      `Обучение и развитие:
        проведение менторских сессий для junior/middle-разработчиков;
        организация код-ревью с целью повышения качества кода.`,
      `Time-Management: грамотное планирование задач, соблюдение сроков.`,
      `Адаптивность: готовность работать в быстро меняющихся условиях.`,
      `Креативность: поиск новых идей для улучшения продукта и процессов разработки.`,

    ],
  },
  {
    title: 'Hard Skills',
    text: [
      `JavaScript (ES6+): глубокие знания языка, включая современные синтаксис и функционал (промисы,
        async/await, модули, декораторы).`,
      `Vue.js 2/3:
        разработка сложных SPA-приложений, настройка реактивности, работа с Vue Router и Vuex/Pinia;
        оптимизация производительности Vue-приложений;
        миграция проектов с Vue 2 на Vue 3.`,
      `UI-фреймворки:
        Vuetify: кастомизация компонентов, настройка темизации, работа с DataTable, Form Validation;
        опыт работы с другими UI-библиотеками, такими как ElementUI, Quasar, Bootstrap-Vue.`,
      `React (учебный опыт):
        понимание архитектуры React, хуков (Hooks), работа с Context API, React Router;
        использование Redux для управления состоянием.`,
      `HTML/CSS:
        адаптивная и кроссбраузерная верстка, знание CSS-препроцессоров (SASS/SCSS);
        применение CSS-фреймворков и методологий (BEM).`,
      `TypeScript: уверенное использование для типизации сложных приложений.`,
      `Тестирование: написание юнит-тестов (Jest), интеграционные и e2e-тесты (Cypress).`,
      `Backend-интеграция: работа с REST API, WebSocket, опыт взаимодействия с GraphQL.`,
      `DevOps: базовые навыки CI/CD (GitLab CI, GitHub Actions), опыт настройки Docker для разработки и
        деплоя.`,
      `Git: опыт работы с git-flow, ревью кода, разрешение конфликтов.`,
      `Проектирование приложений: опыт проектирования архитектуры SPA и разработки компонентов для
        повторного использования.`,
    ],
  }
];

const images = [
  'html5',
  'css3',
  'javaScript',
  'typeScript',
  'vue',
  'vuetify',
  'react',
  'tailwindCss',
  'nuxt',
  'nest',
  'sequelize',
  'postgresSQL',
  'postman',
  'git',
  'gitLab',
  'docker',
  'jenkins',
  'linux',
];
</script>

<style scoped></style>