<template>
  <article class="w-full">
    <HeroSection :background="backgroundImg">
      <HeroContent title="Nikita Chepik" description="Мой код — это инструмент для роста бизнеса!" />
    </HeroSection>
    <ResumeWhyWebDevSection title="Почему я выбрал веб-разработку" :reason="reasons" />
    <ResumeTechnologyStackSection
      title="Стек технологий"
      description="Использую современные инструменты для создания отзывчивых и производительных интерфейсов. Ориентирован на качество кода и итоговый пользовательский опыт."
      :images="images"
    />
    <ResumeSkillsSection title="Навыки" :softs="softSkills" :hards="hardSkills" />
  </article>
</template>

<script setup lang="ts">
import { onMounted } from 'vue';
import backgroundImg from '~/assets/resume.png';
import { useResume } from '~/composables/hooks/useResume';

const {
  softSkills,
  hardSkills,
  reasons,
  loading,
  fetchAll
} = useResume()

onMounted(async () => {
  await fetchAll()
})

const historyText = [
  { title: "Непрерывное развитие и вызов", description: "Программирование для меня — это, в первую очередь, постоянное развитие. Сфера IT очень динамична: технологии и инструменты быстро устаревают, а каждый новый проект — это шанс освоить что‑то новое. Это не позволяет работе стать рутиной и делает её по‑настоящему увлекательной." },
  { title: "Мотивация через результат ", description: "Я получаю огромное удовлетворение, когда вижу реальные результаты своего труда. Осознание того, что созданное тобой программное обеспечение решает конкретные проблемы людей или оптимизирует бизнес-процессы, вызывает чувство гордости." },
  { title: "Пространство для креатива", description: "Несмотря на техническую основу, в программировании много простора для креативности. Проектирование архитектуры приложения, разработка интерфейсов и поиск нестандартных решений — все это позволяет воплощать в жизнь собственные идеи и подходы." },
  { title: "Вдохновляющее сотрудничество", description: "Меня вдохновляет работа в команде с увлечёнными и талантливыми коллегами. Совместное обсуждение идей, обмен знаниями и слаженная работа над сложными задачами создают атмосферу взаимной поддержки. Это повышает качество результата и делает процесс более приятным." },
  { title: "Комфорт и независимость", description: "Наконец, я ценю ту свободу, которую даёт эта профессия. Возможность работать удалённо, выбирать интересные проекты и гибко планировать своё время делает карьеру программиста очень комфортной." },
  { title: "Наполненная смыслом карьера", description: "Все эти грани в совокупности наполняют мою профессиональную жизнь смыслом и делают её невероятно интересной." },
];

const itemsS = [
  { title: 'Лидерство и управление командой', content: 'Опыт управления командой разработчиков: формулировка видения, постановка чётких и измеримых задач, эффективное распределение ролей с учётом сильных сторон каждого участника. Постоянно работаю над созданием позитивной и продуктивной атмосферы, где важны как достижение общих целей, так и личная мотивация каждого члена команды.' },
  { title: 'Коммуникация и взаимодействие', content: 'Считаю, что сложные технические концепции должны быть понятны всем. Умею доступно объяснять идеи и задачи как членам команды (дизайнерам, аналитикам, QA), так и нетехническим специалистам. Это позволяет находить общий язык, избегать недопонимания и эффективно выстраивать рабочие процессы между отделами.' },
  { title: 'Аналитическое решение проблем', content: 'Использую системный подход к решению сложных задач: анализ корневых причин, оценка возможных вариантов и их последствий. Не останавливаюсь на очевидных решениях, если вижу потенциал для более оптимального и нестандартного подхода, который может принести большую ценность продукту.' },
  { title: 'Ответственность и результат', content: 'Готовность брать на себя ответственность за итоговый результат работы команды. Фокус на том, чтобы не просто «закрыть задачу», а чтобы реализованное решение реально соответствовало бизнес-целям и ожиданиям пользователей.' },
  { title: 'Обучение и развитие команды', content: 'Регулярно провожу менторские сессии для junior — и middle-разработчиков, помогая им расти профессионально. Считаю практику регулярного код-ревью не просто формальностью, а мощным инструментом для распространения знаний, выработки единых стандартов и коллективного повышения качества кода.' },
  { title: 'Тайм-менеджмент', content: 'Грамотно планирую задачи, расставляя приоритеты исходя из бизнес-логики и зависимостей. Дисциплинированно подхожу к соблюдению дедлайнов, проактивно сообщая о возможных рисках и затруднениях, что позволяет своевременно корректировать планы.' },
  { title: 'Адаптивность', content: 'Комфортно работаю в условиях неопределённости и быстро меняющихся требований. Гибко перестраиваю приоритеты и подходы, воспринимая изменения не как помеху, а как возможность найти более релевантное решение для продукта.' },
  { title: 'Креативность и оптимизация', content: 'Постоянно нахожусь в поиске новых идей — как для улучшения пользовательского опыта и функциональности продукта, так и для оптимизации внутренних процессов разработки (внедрение новых инструментов, автоматизация рутины, улучшение методологии).' },
  { title: 'Эмоциональный интеллект', content: 'Способность распознавать и учитывать эмоции и мотивацию коллег. Это позволяет предотвращать и разрешать конфликты, конструктивно давать обратную связь и создавать психологически безопасную среду в команде, где каждый чувствует себя услышанным и способным работать максимально эффективно.' },
  { title: '﻿Критическое мышление', content: 'Умение не принимать требования и предложения за абсолютную истину. Я привык задавать уточняющие вопросы: «Какую проблему пользователя мы решаем?», «Почему это решение лучше альтернатив?», «Какие могут быть скрытые риски?». Это помогает избежать лишней работы и выбрать наиболее эффективный путь для достижения цели.' },
  { title: 'Клиентоориентированность', content: 'Понимание, что конечная цель работы — ценность для пользователя и бизнеса. Я всегда стараюсь смотреть на продукт с точки зрения конечного потребителя, задавая вопросы не только «Как это сделать?», но и «Зачем это нужно?». Это помогает принимать решения, которые улучшают пользовательский опыт и напрямую влияют на ключевые метрики проекта.' },
]

const itemsH = [
  { title: 'JavaScript (ES6+)', content: 'Глубокие знания языка, включая современные синтаксис и функционал (промисы, async/await, модули, декораторы).' },
  { title: 'Vue.js 2/3', content: 'Разработка сложных SPA-приложений, настройка реактивности, работа с Vue Router и Vuex/Pinia; оптимизация производительности Vue-приложений; миграция проектов с Vue 2 на Vue.' },
  { title: 'UI-фреймворки. Vuetify', content: 'Кастомизация компонентов, настройка темизации, работа с DataTable, Form Validation; опыт работы с другими.' },
  { title: 'React (учебный опыт)', content: 'Понимание архитектуры React, хуков (Hooks), работа с Context API, React Router; использование Redux для управления состоянием.' },
  { title: 'HTML/CSS', content: 'Адаптивная и кроссбраузерная верстка, знание CSS-препроцессоров (SASS/SCSS); применение CSS-фреймворков и методологий (BEM).' },
  { title: 'TypeScript', content: 'Уверенное использование для типизации сложных приложений.' },
  { title: 'Тестирование', content: 'Написание юнит-тестов (Jest), интеграционные и e2e-тесты (Cypress).' },
  { title: 'Backend-интеграция', content: 'Работа с REST API, WebSocket, опыт взаимодействия с GraphQL.' },
  { title: '﻿DevOps', content: 'Базовые навыки CI/CD (GitLab CI, GitHub Actions), опыт настройки Docker для разработки и деплоя.' },
  { title: 'Git', content: 'Git: опыт работы с git-flow, ревью кода, разрешение конфликтов.' },
  { title: '﻿Проектирование приложений', content: 'Опыт проектирования архитектуры SPA и разработки компонентов для повторного использования.' },
]

const images = [
  'html5',
  'css3',
  'javaScript',
  'typeScript',
  'vue',
  'vuetify',
  'react',
  'tailwindCss',
  'nuxt',
  'nest',
  'sequelize',
  'postgresSQL',
  'postman',
  'git',
  'gitLab',
  'docker',
  'jenkins',
  'linux',
];
</script>

<style scoped></style>